# Stock Price Analysis and Comparison

Vincent Luong

Write brief introduction about time series analysis

In [1]:
import numpy as np
import pandas as pd
from datetime import datetime as dt
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## Importing Datasets and Summary Statistics

### Tesla

In [2]:
tesla_dat = pd.read_csv('data/tesla.csv')
tesla_dat.head()

         Date   Open   High    Low  Close  Adj Close    Volume
0  2010-06-29  3.800  5.000  3.508  4.778      4.778  93831500
1  2010-06-30  5.158  6.084  4.660  4.766      4.766  85935500
2  2010-07-01  5.000  5.184  4.054  4.392      4.392  41094000
3  2010-07-02  4.600  4.620  3.742  3.840      3.840  25699000
4  2010-07-06  4.000  4.000  3.166  3.222      3.222  34334500

From the tesla dataset, we have 7 features (1 categorical and 6 numerical):

-`Date`: The date M/D/Y<br>
-`Open`: The opening price of stock (in USD) <br>
-`High`: The high price of that day (in USD) <br>
-`Low`: The low price of that day (in USD) <br> 
-`Close`: The closed price of that day (in USD) <br>
-`Volume`: The amount of stocks traded during that day <br>
-`Adj Close`: The stock's closing price that has been amended to include any distributions/coporate actions that occurs before next days open (in USD) <br>

In [3]:
tesla_dat.describe

<bound method NDFrame.describe of             Date         Open         High         Low        Close  \
0     2010-06-29     3.800000     5.000000    3.508000     4.778000
1     2010-06-30     5.158000     6.084000    4.660000     4.766000
2     2010-07-01     5.000000     5.184000    4.054000     4.392000
3     2010-07-02     4.600000     4.620000    3.742000     3.840000
4     2010-07-06     4.000000     4.000000    3.166000     3.222000
...          ...          ...          ...         ...          ...
2951  2022-03-18   874.489990   907.849976  867.390015   905.390015
2952  2022-03-21   914.979980   942.849976  907.090027   921.159973
2953  2022-03-22   930.000000   997.859985  921.750000   993.979980
2954  2022-03-23   979.940002  1040.699951  976.400024   999.109985
2955  2022-03-24  1009.729980  1024.489990  988.799988  1013.919983

        Adj Close    Volume
0        4.778000  93831500
1        4.766000  85935500
2        4.392000  41094000
3        3.840000  25699000
4        3.222000  34334500
...           ...       ...
2951   905.390015  33408500
2952   921.159973  27327200
2953   993.979980  35289500
2954   999.109985  40225400
2955  1013.919983  22901900

[2956 rows x 7 columns]>

In [4]:
tesla_dat.shape

(2956, 7)

In [5]:
tesla_dat['Date'].min()

'2010-06-29'

In [6]:
tesla_dat['Date'].max()

'2022-03-24'

**Note**: Since the format is Y-M-D, it looks like the data ranges from the start of June 2010 to March 2022, for a total of 12 years.

### S&P 500

In [7]:
s500_dat = pd.read_csv('data/s500.csv')
s500_dat.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

From the S&P 500 dataset, we also have 7 features.  With 5 numerical features and 2 categorical features we have the following:

-`date`: The date Y-M-D <br>
-`open`: Price of the stock at market open (in USD) <br>
-`high`: Highest price reached that day (in USD) <br>
-`low`: lowest price reached in the day (in USD) <br>
-`Volume`: Number of shares traded <br>
-`Name`: The stock's ticker name

In [8]:
s500_dat.describe

<bound method NDFrame.describe of               date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619040 rows x 7 columns]>

In [9]:
#See if this dataset includes TSLA stocks

#unique_count = s500_dat['Name'].unique()
#for name in unique_count:
#    print(name)


#Code ran and it doesn't include Stocks from TSLA

In [10]:
s500_dat.shape

(619040, 7)

In [11]:
s500_dat['date'].min()

'2013-02-08'

In [12]:
s500_dat['date'].max()

'2018-02-07'

**Note**: Since the format is Y/M/D, the data ranges from the start of Feburary 2013 to Feburary 2018, for a total of 5 years.

## Discovering Seperate Measurements

Since the Tesla dataset doesn't include any non-date categorical variables, we can ignore that and perform EDA on the S&P 500 dataset.

In [13]:
s500_dat.sort_values(by="date").head()

              date    open      high      low   close   volume Name
0       2013-02-08   15.07   15.1200   14.630   14.75  8407500  AAL
508224  2013-02-08   81.22   81.9300   80.940   81.89   296853  SLG
506965  2013-02-08   78.24   79.0700   78.125   79.07  4632684  SLB
85755   2013-02-08  236.64  238.6924  235.750  238.16   552207  BLK
505706  2013-02-08   89.04   89.4800   88.910   89.16   554948  SJM

From the above, we definitely see stock prices flucutating on the same date for different names, now lets group by names

In [14]:
s500_dat.sort_values(by=["Name", "date"]).head()

             date   open   high    low  close   volume Name
71611  2013-02-08  45.07  45.35  45.00  45.08  1824755    A
71612  2013-02-11  45.17  45.18  44.45  44.60  2915405    A
71613  2013-02-12  44.81  44.95  44.50  44.62  2373731    A
71614  2013-02-13  44.81  45.24  44.68  44.75  2052338    A
71615  2013-02-14  44.72  44.78  44.36  44.58  3826245    A

Since we see that we have a sequence of dates with a single row per date, we can see that we have seperate timeseries for each combinations of `Name`.  This make sense as S&P 500 is an index fund composed of many stocks in the stock market.  To simplify the project, we will split the data to only analyze data that is from the **top 4 highest volumes** of trades.

## Finding the Markets with Highest Trade Volume

### Data Cleaning

In [15]:
##Convert to datetime
tesla_dat["Date"] = pd.to_datetime(tesla_dat["Date"])
s500_dat["date"] = pd.to_datetime(s500_dat["date"])

In [16]:
#Code taken from Kaggle Notebook https://www.kaggle.com/code/avikumart/timeseries-stock-price-analysis-forecasting

# rename Name to ticks
rdf = s500_dat.rename(columns={'Name':'ticks'})

# drop the null as they a few values and time-series won't be affected by such values
rdf.dropna(inplace=True)

# change the dtype of date column
new_df = rdf.copy()
new_df.loc[:, 'date'] = pd.to_datetime(rdf.loc[:, 'date'], format='%Y/%m/%d')

new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 619029 entries, 0 to 619039
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    619029 non-null  datetime64[ns]
 1   open    619029 non-null  float64
 2   high    619029 non-null  float64
 3   low     619029 non-null  float64
 4   close   619029 non-null  float64
 5   volume  619029 non-null  int64
 6   ticks   619029 non-null  object
dtypes: datetime64[ns](1), float64(4), int64(1), object(1)
memory usage: 37.8+ MB

C:\Users\vince\AppData\Local\Temp\ipykernel_14420\3230567191.py:11: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  new_df.loc[:, 'date'] = pd.to_datetime(rdf.loc[:, 'date'], format='%Y/%m/%d')

### Finding Highest Mean Volume

In [17]:
# find the average volume of each stocks using function and sort top 4 most traded stocks for further analysis 
mean_dict = {}

# find average of volume traded over a period of time using for loops
for key in new_df['ticks'].unique():
    value = new_df[new_df['ticks'] == key ]['volume'].mean()
    mean_dict[key]= value

print("Length of the mean of ticks dictionary:", len(mean_dict))

# convert dict to pandas dataframe
avaerage_s = pd.Series(mean_dict).transpose()
top4_s = avaerage_s.sort_values(ascending=False)[:4]

print("Top 4 company tickers with highest average traded stock volume:\n", top4_s.index)

Length of the mean of ticks dictionary: 505
Top 4 company tickers with highest average traded stock volume:
 Index(['BAC', 'AAPL', 'GE', 'F'], dtype='object')

### Dividing the Dataframes

From the code above, we see that the markets with the highest volume are:
1. Bank of America
2. Apple
3. General Electric
4. Ford Motor Company

We will then divide the dataframes accordingly:

In [18]:
## Bank of America
bac = s500_dat.loc[s500_dat['Name'] == 'BAC']
bac.head()

            date   open   high    low   close     volume Name
72870 2013-02-08  11.86  11.90  11.72  11.760  145217221  BAC
72871 2013-02-11  11.73  11.90  11.67  11.860  103499848  BAC
72872 2013-02-12  11.87  12.34  11.78  12.245  231771561  BAC
72873 2013-02-13  12.35  12.42  12.05  12.170  192478919  BAC
72874 2013-02-14  12.09  12.27  12.07  12.130  143901737  BAC

In [19]:
## Apple
apple = s500_dat.loc[s500_dat['Name'] == 'AAPL']
apple.head()

           date     open     high      low    close     volume  Name
1259 2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
1260 2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
1261 2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
1262 2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
1263 2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL

In [20]:
## General Electric
ge = s500_dat.loc[s500_dat['Name'] == 'GE']
ge.head()

             date   open   high    low  close    volume Name
242754 2013-02-08  22.50  22.56  22.45  22.50  24424506   GE
242755 2013-02-11  22.49  22.51  22.35  22.45  19738628   GE
242756 2013-02-12  22.48  22.65  22.48  22.58  34139526   GE
242757 2013-02-13  23.11  23.48  23.04  23.39  84933955   GE
242758 2013-02-14  23.25  23.49  23.11  23.41  53990644   GE

In [21]:
## Facebook
fb = s500_dat.loc[s500_dat['Name'] == 'F']
fb.head()

             date   open   high    low  close    volume Name
240236 2013-02-08  13.10  13.16  13.05  13.10  18596061    F
240237 2013-02-11  13.06  13.20  13.02  13.11  17685616    F
240238 2013-02-12  13.12  13.20  13.05  13.08  26231279    F
240239 2013-02-13  13.11  13.14  12.99  13.04  24501066    F
240240 2013-02-14  13.00  13.17  12.96  13.11  33487476    F

## Splitting the Data

Since there is mis-matching in the date ranges, we will focus on the dates the exists in both datasets to handle the differences in dates.

In [22]:
tesla_dat = tesla_dat[(tesla_dat['Date'] >= '2013-02-08') & (tesla_dat['Date'] <= '2018-02-07')]
print("Tesla Date Range:", tesla_dat["Date"].min(), "to", tesla_dat["Date"].max())
print("S&P 500 Date Range:", s500_dat["date"].min(), "to", s500_dat["date"].max())

Tesla Date Range: 2013-02-08 00:00:00 to 2018-02-07 00:00:00
S&P 500 Date Range: 2013-02-08 00:00:00 to 2018-02-07 00:00:00

Now that the dates are matched, we now have a total of 5 years of data from Feburary 2013 to Feburary 2018.  Lets split the data so we have **one year** of testing data for each dataframe.

In [24]:
split_date = pd.to_datetime('20170207', format='%Y%m%d')

tesla_train = tesla_dat[tesla_dat["Date"] <= split_date]
tesla_test  = tesla_dat[tesla_dat["Date"] >  split_date]

bac_train = bac[bac["date"] <= split_date]
bac_test = bac[bac["date"] > split_date]

apple_train = apple[apple["date"] <= split_date]
apple_test = apple[apple["date"] > split_date]

ge_train = ge[ge["date"] <= split_date]
ge_test = ge[ge["date"] > split_date]

fb_train = fb[fb["date"] <= split_date]
fb_test = fb[fb["date"] > split_date]

print("Tesla Train Date Range:", tesla_train["Date"].min(), "to", tesla_train["Date"].max())
print("Tesla Test Date Range:", tesla_test["Date"].min(), "to", tesla_test["Date"].max())
print("Bank of America Train Date Range:", bac_train["date"].min(), "to", bac_train["date"].max())
print("Bank of America Test Date Range:", bac_test["date"].min(), "to", bac_test["date"].max())
print("Apple Date Range:", apple_train["date"].min(), "to", apple_train["date"].max())
print("Apple Test Date Range:", apple_test["date"].min(), "to", apple_test["date"].max())
print("General Electic Date Range:", ge_train["date"].min(), "to", ge_train["date"].max())
print("General Electric Test Date Range:", ge_test["date"].min(), "to", ge_test["date"].max())
print("Facebook Date Range:", fb_train["date"].min(), "to", fb_train["date"].max())
print("Facebook Test Date Range:", fb_test["date"].min(), "to", fb_test["date"].max())

Tesla Train Date Range: 2013-02-08 00:00:00 to 2017-02-07 00:00:00
Tesla Test Date Range: 2017-02-08 00:00:00 to 2018-02-07 00:00:00
Bank of America Train Date Range: 2013-02-08 00:00:00 to 2017-02-07 00:00:00
Bank of America Test Date Range: 2017-02-08 00:00:00 to 2018-02-07 00:00:00
Apple Date Range: 2013-02-08 00:00:00 to 2017-02-07 00:00:00
Apple Test Date Range: 2017-02-08 00:00:00 to 2018-02-07 00:00:00
General Electic Date Range: 2013-02-08 00:00:00 to 2017-02-07 00:00:00
General Electric Test Date Range: 2017-02-08 00:00:00 to 2018-02-07 00:00:00
Facebook Date Range: 2013-02-08 00:00:00 to 2017-02-07 00:00:00
Facebook Test Date Range: 2017-02-08 00:00:00 to 2018-02-07 00:00:00

## Explanatory Data Analysis

Make a bunch of graphs